blog/2020/04/php-packaging-in-nixos/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-03-17 Wed 13:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>PHP packaging in NixOS ❄</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Elis Hirwing &lt;elis@hirwing.se&gt;">
<link href="https://elis.nu/" rel="canonical">
<link rel="stylesheet" type="text/css" href="/style.css" />
<link rel="alternate" type="application/rss+xml" title="~elis/blog/" href="/blog/rss.xml" />
<link rel="icon" href="/imgs/favicon.jpg">
<meta name="referrer" content="no-referrer" />
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="preamble" class="status">
<nav>
     <ul>
       <li><a href="/">~elis/</a></li>
       <li><a href="/about/">./about/</a></li>
       <li><a href="/work/">./work/</a></li>
       <li><a href="/talks/">./talks/</a></li>
       <li><a href="/blog/">./blog/</a></li>
     </ul>
   </nav>
</div>
<div id="content">
<h1 class="title">PHP packaging in NixOS ❄</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="/blog/2020/04/php-packaging-in-nixos/#state-of-php-before-nixos-20.09">State of PHP before NixOS 20.09</a></li>
<li><a href="/blog/2020/04/php-packaging-in-nixos/#the-road-to-a-better-php-packaging-ecosystem">The road to a better PHP packaging ecosystem</a></li>
<li><a href="/blog/2020/04/php-packaging-in-nixos/#state-of-php-in-nixos-in-20.09-and-beyond">State of PHP in NixOS in 20.09 and beyond</a></li>
</ul>
</div>
</div>
<p>
This is a sneak peak into the future 20.09 release of NixOS.
</p>

<p>
The PHP packaging ecosystem in NixOS has been in a quite sad state for a long
time. Partly because of the lack of people caring about PHP in Nix, but also
that PHP is a bit weird when it comes to packaging.
</p>

<article id="outline-container-orgfa59c7a" class="outline-2">
<h2 id="state-of-php-before-nixos-20.09">State of PHP before NixOS 20.09</h2>
<div class="outline-text-2" id="text-state-of-php-before-nixos-20.09">
<p>
Due to the lack of ability to do clever things like the python community does
with <code>withPackages</code> to compose a package with the dependencies you need we
have defaulted to provide a huge default package to accommodate all needs.
</p>

<p>
We have been quite bad at accommodating all needs though…
</p>

<p>
I'm gonna give a few examples.
</p>

<p>
PHP in NixOS has defaulted to including for example the following modules:
</p>
<ul class="org-ul">
<li><code>curl</code></li>
<li><code>pdo_mysql</code></li>
<li><code>pdo_odbc</code></li>
<li><code>pdo_pgsql</code></li>
<li><code>imap</code></li>
<li><code>ldap</code></li>
</ul>

<p>
… among many other modules. Some of these are quite convenient to get (such
as database related extensions). But some of these are totally unreasonable
to have as default in a distribution. But due to the nature of Nix and the
lack of easily extending PHP we have just coped with having a huge
distribution of PHP.
</p>

<p>
Also, at the same time we have lacked some other notable extensions in the
default build, such as <code>opcache</code>, without recompiling PHP…
</p>

<p>
So users migrating from another distribution, for example anything based on
Debian that defaults to having opcache enabled by default will see a drastic
performance penalty by migrating to NixOS. This can be fixed by enabling the
opcache flag for the build and recompile the entire PHP package. How fun…
</p>
</div>
</article>

<article id="outline-container-orga3bfcfb" class="outline-2">
<h2 id="the-road-to-a-better-php-packaging-ecosystem">The road to a better PHP packaging ecosystem</h2>
<div class="outline-text-2" id="text-the-road-to-a-better-php-packaging-ecosystem">
<p>
Real work and thought into this project started in December 2019 when I had
a chat with Grahamc about a packaging in PHP. And he referred me to talk to a
another person that was doing a modular PHP setup. I got some notes and
started to work on it but it proved to be a huge project. So it kinda died
off there.
</p>

<p>
Then <a href="https://github.com/NixOS/nixpkgs/pull/79377">PHP: buildEnv function for additional config on the CLI SAPI</a> happened
that made it easier to extend PHP as it was, and I was really happy to see
this work happening since it really followed along some of the things I
wanted to do. So I set off and made <a href="https://github.com/NixOS/nixpkgs/pull/82348">PHP extensions as packages</a> to package
almost all PHP extensions as separate packages. With this it would be easier
to pull in official PHP extensions into the PHP package without the need to
recompile it.
</p>

<p>
This led to the end game to have a really small PHP as base, but it's easy
to extend. This led me to the path to start with <a href="https://github.com/NixOS/nixpkgs/pull/82794">PHP: Make the default
package more sane</a> of the first iteration. But it proved to be a big project,
so <a href="https://github.com/talyz/">@talyz</a> and me teamed up with to bring this project to what we wanted
to achieve.
</p>

<p>
This finally ended up as the following pull request:
<a href="https://github.com/NixOS/nixpkgs/pull/83896">PHP: Make the default package more sane (v3)</a>. That now has been merged into
nixpkgs. This PR change the entire PHP ecosystem in NixOS.
</p>
</div>
</article>

<article id="outline-container-orgbceb29c" class="outline-2">
<h2 id="state-of-php-in-nixos-in-20.09-and-beyond">State of PHP in NixOS in 20.09 and beyond</h2>
<div class="outline-text-2" id="text-state-of-php-in-nixos-in-20.09-and-beyond">
<p>
The things we have done:
</p>
<ul class="org-ul">
<li>We have made a really small PHP as base</li>
<li>But we extend it by default to contain a bigger set of packages to not
for break our users.</li>
<li>We provide almost all upstream extensions and a bunch of 3rd party ones
for inclusion into your PHP.</li>
<li>We have written the initial documentation for how to use PHP on Nix.</li>
<li>We have enabled running tests for every upstream extension of PHP by
default. And we do it when we build each extension in a sandbox separate
from each other (This has some issues though).</li>
<li>We have added <code>opcache</code> as a default extension.</li>
</ul>

<p>
So hereby I now make the following claim:
</p>

<p>
NixOS now have the best packaging of PHP on any distribution of any operating
system out there when it comes to the following properties:
</p>
<ul class="org-ul">
<li>Opportunity for minimalist install</li>
<li>Flexibility to select exactly which extensions you want</li>
</ul>

<p>
Example to build a PHP with exactly the extensions I want:
</p>
<div class="org-src-container">
<pre class="src src-nix">php.withExtensions ({ enabled, all }: <span class="org-nix-keyword">with</span> all; [
  curl imagick opcache redis pdo_mysql pdo mysqlnd
  openssl posix sodium sockets
])
</pre>
</div>

<p>
And since Nix can be used to build Docker images and be used for deployments,
this becomes a damn powerful packaging even for users that don't want to run
NixOS but want to have the power of quickly customizing PHP to exactly their
needs for that specific application.
</p>

<p>
<b>Let's say it again:</b>
NixOS now has the single best PHP packaging that exists in terms of
flexibility, being reproducible and being minimalistic at the same time.
</p>
</div>
</article>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-04-05 Sun 20:00</p>
<p class="author">Author: Elis Hirwing &lt;elis@hirwing.se&gt;</p>
<p class="date">Created: 2021-03-17 Wed 13:33</p>
</div>
</body>
</html>
